# Assignment-1 Panda Basic

# Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [1]:
import pandas as pd

In [3]:
s_data = pd.Series([4,8,15,16,23,42])

In [4]:
print(s_data)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [5]:
type(s_data)

pandas.core.series.Series

# Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

In [6]:
list_ = [1,2,3,4,5,6,7,8,9,10]

In [8]:
s_list = pd.Series(list_)

In [9]:
print(s_list)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

# Q3. Create a Pandas DataFrame that contains the following data:
# Name: Alice, Bob, Claire
# Age : 25 , 30 , 27
# Gender : Female , Male , Female
Then, print the dataframe

In [17]:
# using dicitionary:--
d = {
    "Name" : ['Alice', 'Bob' , 'Claire'],
    "Age": [25,30,27],
    "Gender" : ["Female", "Male", "Female"]
}

In [18]:
d

{'Name': ['Alice', 'Bob', 'Claire'],
 'Age': [25, 30, 27],
 'Gender': ['Female', 'Male', 'Female']}

In [20]:
df = pd.DataFrame(d)

In [21]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [22]:
type(df)

pandas.core.frame.DataFrame

# Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

📘 What is a DataFrame in Pandas?
In Pandas, a DataFrame is a two-dimensional tabular data structure with rows and columns, similar to a table in a database or an Excel spreadsheet.

It can hold multiple columns, each of different data types (int, float, string, etc.).

Think of it like a dictionary of pandas.Series, all sharing the same row index.

📘 What is a Series in Pandas?
A pandas.Series is a one-dimensional array-like structure that can hold any data type.

It has only one column of data and an associated index.

In [23]:
# creating a series
Series = pd.Series([10,20,30], name = "Marks")

In [24]:
print("Series:")
print(Series)
print("Type: ", type(Series))

Series:
0    10
1    20
2    30
Name: Marks, dtype: int64
Type:  <class 'pandas.core.series.Series'>

In [25]:
# creating a DataFrame
data = {
    'Name' : ['Alice', 'Bob', 'Charlie'],
    'Marks' : [85,90,95]
}

In [26]:
df = pd.DataFrame(data)
print("DataFrame: ")
print(df)
print("Type: ", type(df))

DataFrame:
      Name  Marks
0    Alice     85
1      Bob     90
2  Charlie     95
Type:  <class 'pandas.core.frame.DataFrame'>

# Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

In [30]:
# i > head() -> it extract top 5 data from the top by default
df.head(2)

    Name  Marks
0  Alice     85
1    Bob     90

In [31]:
# ii> tail() -> it extract top 5 bottom data by defalut
df.tail(2)

      Name  Marks
1      Bob     90
2  Charlie     95

In [32]:
df['Name']

0      Alice
1        Bob
2    Charlie
Name: Name, dtype: object

In [33]:
df.columns

Index(['Name', 'Marks'], dtype='object')

In [34]:
df[["Name", "Marks"]]

      Name  Marks
0    Alice     85
1      Bob     90
2  Charlie     95

# Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

All three — Series, DataFrame, and Panel — are mutable in nature.

But here's a more detailed explanation:

# 1> Series - ✅ Mutable
A Series is one-dimensional and allows modification of values, index, etc.

In [35]:
s = pd.Series([1,2,3])
s[0]=10
print(s)

0    10
1     2
2     3
dtype: int64

# 2> DataFrame - ✅ Mutable
A DataFrame is two-dimensional and is fully mutable — you can modify values, add/remove columns or rows.

In [37]:
df = pd.DataFrame({'A' : [1,2], 'B': [3,4]})
df.loc[0, 'A'] = 100
print(df)

     A  B
0  100  3
1    2  4

# 3> Panel - ✅ Mutable but ❌ Deprecated
Panel was used for 3D data (like a 3D spreadsheet).

It is mutable, but it has been deprecated since Pandas 1.0.0 (January 2020).

Use MultiIndex DataFrames or xarray instead for 3D data.

✅ All three — Series, DataFrame, and Panel — are mutable in nature,
but Panel is deprecated and should be avoided in new projects.

# Q7. Create a DataFrame using multiple Series. Explain with an example.

In [38]:
# Create multiple Series
names = pd.Series(['Alice','Bob','Charlie'])
marks = pd.Series([85,90,95])
subjects = pd.Series(['Math','Science','English'])

In [39]:
# combine series into a DataFrame
df = pd.DataFrame({
    'Name': names,
    'Marks': marks,
    'Subject': subjects
})
print(df)

      Name  Marks  Subject
0    Alice     85     Math
1      Bob     90  Science
2  Charlie     95  English